---
kind: method
id: M:Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetModifiedElementIds
source: html/e88a65d4-9d58-bbd6-984c-70aa8736c118.htm
---
# Autodesk.Revit.DB.Events.DocumentChangedEventArgs.GetModifiedElementIds Method

Returns set of elements that were modified.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetModifiedElementIds()
```

## Returns
The set of ElementId for elements that were modified.